# MySQL Assignment ‚Äì WHERE, ORDER BY, LIKE

**Student Name:** Annam  
**Date:** February 9, 2026  
**Topic:** SQL Queries with WHERE (AND/OR/NOT), ORDER BY, and LIKE Operators

---

## 1Ô∏è‚É£ Create Database

First, we create a database called `college_db` and select it for use.

In [ ]:
CREATE DATABASE college_db;
USE college_db;

**Output:** Database created successfully.

---

## 2Ô∏è‚É£ Create Tables

We'll create two tables:
- **students**: Contains student information
- **marks**: Contains marks/scores for different subjects

### üìò Table 1: students

In [ ]:
CREATE TABLE students (
    student_id INT PRIMARY KEY,
    name VARCHAR(50),
    department VARCHAR(50),
    age INT
);

### üìó Table 2: marks

In [ ]:
CREATE TABLE marks (
    mark_id INT PRIMARY KEY,
    student_id INT,
    subject VARCHAR(50),
    score INT
);

**Output:** Both tables created successfully.

---

## 3Ô∏è‚É£ Insert Sample Data

Now we'll populate both tables with sample data.

### Insert into students table

In [ ]:
INSERT INTO students VALUES
(1, 'Annam', 'CSE', 21),
(2, 'Ravi', 'ECE', 20),
(3, 'Sita', 'CSE', 22),
(4, 'Aman', 'MECH', 23),
(5, 'Nithin', 'CSE', 20);

### Insert into marks table

In [ ]:
INSERT INTO marks VALUES
(101, 1, 'DBMS', 85),
(102, 2, 'DBMS', 72),
(103, 3, 'OS', 90),
(104, 4, 'DBMS', 60),
(105, 5, 'OS', 88);

**Output:** 5 rows inserted into students table and 5 rows inserted into marks table.

---

## 4Ô∏è‚É£ WHERE with AND

**Query:** Retrieve students from CSE department whose age is above 20.

In [ ]:
SELECT * FROM students
WHERE department = 'CSE' AND age > 20;

**Expected Output:**

| student_id | name  | department | age |
|------------|-------|------------|-----|
| 1          | Annam | CSE        | 21  |
| 3          | Sita  | CSE        | 22  |

**Explanation:** This query returns only students who satisfy BOTH conditions: they must be in CSE department AND their age must be greater than 20.

---

## 5Ô∏è‚É£ WHERE with OR

**Query:** Retrieve students from either CSE or ECE departments.

In [ ]:
SELECT * FROM students
WHERE department = 'CSE' OR department = 'ECE';

**Expected Output:**

| student_id | name   | department | age |
|------------|--------|------------|-----|
| 1          | Annam  | CSE        | 21  |
| 2          | Ravi   | ECE        | 20  |
| 3          | Sita   | CSE        | 22  |
| 5          | Nithin | CSE        | 20  |

**Explanation:** This query returns students who satisfy EITHER condition: they can be in CSE OR ECE department.

---

## 6Ô∏è‚É£ WHERE with NOT

**Query:** Retrieve all students EXCEPT those from MECH department.

In [ ]:
SELECT * FROM students
WHERE NOT department = 'MECH';

**Expected Output:**

| student_id | name   | department | age |
|------------|--------|------------|-----|
| 1          | Annam  | CSE        | 21  |
| 2          | Ravi   | ECE        | 20  |
| 3          | Sita   | CSE        | 22  |
| 5          | Nithin | CSE        | 20  |

**Explanation:** The NOT operator excludes students from MECH department, returning all others.

---

## 7Ô∏è‚É£ ORDER BY

The ORDER BY clause is used to sort the result set in ascending or descending order.

### Query 1: Sort students by age (Ascending)

In [ ]:
SELECT * FROM students
ORDER BY age ASC;

**Expected Output:**

| student_id | name   | department | age |
|------------|--------|------------|-----|
| 2          | Ravi   | ECE        | 20  |
| 5          | Nithin | CSE        | 20  |
| 1          | Annam  | CSE        | 21  |
| 3          | Sita   | CSE        | 22  |
| 4          | Aman   | MECH       | 23  |

**Explanation:** Students are sorted from youngest to oldest.

### Query 2: Sort marks by score (Descending)

In [ ]:
SELECT * FROM marks
ORDER BY score DESC;

**Expected Output:**

| mark_id | student_id | subject | score |
|---------|------------|---------|-------|
| 103     | 3          | OS      | 90    |
| 105     | 5          | OS      | 88    |
| 101     | 1          | DBMS    | 85    |
| 102     | 2          | DBMS    | 72    |
| 104     | 4          | DBMS    | 60    |

**Explanation:** Marks are sorted from highest to lowest score.

---

## 8Ô∏è‚É£ LIKE Operator

The LIKE operator is used for pattern matching in strings.
- `%` represents zero or more characters
- `_` represents a single character

### Query 1: Names starting with 'A'

In [ ]:
SELECT * FROM students
WHERE name LIKE 'A%';

**Expected Output:**

| student_id | name  | department | age |
|------------|-------|------------|-----|
| 1          | Annam | CSE        | 21  |
| 4          | Aman  | MECH       | 23  |

**Explanation:** Returns all students whose name starts with the letter 'A'.

### Query 2: Names containing 'i'

In [ ]:
SELECT * FROM students
WHERE name LIKE '%i%';

**Expected Output:**

| student_id | name   | department | age |
|------------|--------|------------|-----|
| 2          | Ravi   | ECE        | 20  |
| 3          | Sita   | CSE        | 22  |
| 5          | Nithin | CSE        | 20  |

**Explanation:** Returns all students whose name contains the letter 'i' anywhere in it.

### Query 3: Subjects ending with 'S'

In [ ]:
SELECT * FROM marks
WHERE subject LIKE '%S';

**Expected Output:**

| mark_id | student_id | subject | score |
|---------|------------|---------|-------|
| 101     | 1          | DBMS    | 85    |
| 102     | 2          | DBMS    | 72    |
| 104     | 4          | DBMS    | 60    |

**Explanation:** Returns all records where the subject name ends with the letter 'S'.

---

##  Summary

This assignment demonstrates:

1. **WHERE with AND**: Both conditions must be true
2. **WHERE with OR**: At least one condition must be true
3. **WHERE with NOT**: Excludes rows matching the condition
4. **ORDER BY**: Sorts results in ascending (ASC) or descending (DESC) order
5. **LIKE Operator**: Pattern matching with `%` (any characters) and `_` (single character)

---

##  Instructions for Submission

1. **Run all queries** in MySQL or an online SQL compiler
2. **Take screenshots** of each query execution with output
3. **Copy outputs** to a Word document with proper formatting
4. **Include this notebook** in your submission
5. **Upload to GitHub** with README documentation

---

**Tools Used:** MySQL / Online SQL Compiler  
**Submission Date:** February 9, 2026  
**Deadline:** Monday ‚Äì 9:00 PM